In [1]:
import numpy as np
import pandas as pd

import seaborn as sns
import matplotlib.pyplot as plt
%matplotlib inline

# Import Dataset

In [3]:
xls_path = pd.ExcelFile('/Users/dileepsathyan/Documents/GitHub/Assignments/Vroom Virtusa/Analytics_Dataset.xlsx')
df_car_sales   = pd.read_excel(xls_path, 'car_sales')
df_car_details = pd.read_excel(xls_path, 'car_details')
df_car_claims  = pd.read_excel(xls_path, 'car_claims')

In [4]:
df_car_sales.head()

,car_id_sales,country,merchant_id,selling_date,selling_week,payment_date,sell_price,transport_to_merchant,transport_date
0,3421775349,ES,NaN,2021-04-29,2021-17,2021-05-14,1098,1,2021-05-31
1,5316743932,DE,NaN,2021-08-06,2021-31,2021-08-17,435,1,2021-08-31
2,5785159431,FR,NaN,2021-06-03,2021-22,2021-06-08,11028,0,NaN
3,7008763171,DE,NaN,2021-06-07,2021-23,2021-06-08,21100,1,NaN
4,1417558732,DE,NaN,2021-08-31,2021-35,2021-09-02,1943,1,2021-09-09

In [5]:
df_car_details.head()

,car_id_details,has_tuning,has_airbags,has_alarm_system,fuel_type,gear_type,ac_type,xenon_light,navigation_system,radio_system
0,5096178328,1,1,0,1039,1141,1049,0,1100,3534.0
1,1879501444,0,1,1,1039,1138,1049,0,0,3534.0
2,8375508078,1,1,1,1039,1139,0,0,0,1606.0
3,1266330246,0,1,0,1040,1139,1050,0,0,3534.0
4,9079520882,0,0,0,1039,1141,0,0,1100,3534.0

In [6]:
df_car_claims.head()

,car_id_claims,claim_number,full_refunds,partial_refunds,voucher_amount,claim_status
0,7525691980,NaN,0,0,NaN,NaN
1,8543168465,C1AG79687,0,1,620.140528,CLOSED_FULLY_PROCESSED
2,7308726237,NaN,0,0,NaN,NaN
3,9070724843,NaN,0,0,NaN,NaN
4,6274074693,NaN,0,0,NaN,NaN

# Data Cleaning

## 1. Car_Sales Dataframe Cleaning

In [7]:
df_car_sales.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 70512 entries, 0 to 70511
Data columns (total 9 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   car_id_sales           70512 non-null  int64
 1   country                70512 non-null  object
 2   merchant_id            19982 non-null  float64
 3   selling_date           70512 non-null  object
 4   selling_week           70512 non-null  object
 5   payment_date           70512 non-null  object
 6   sell_price             70512 non-null  int64
 7   transport_to_merchant  70512 non-null  int64
 8   transport_date         33082 non-null  object
dtypes: float64(1), int64(3), object(5)
memory usage: 4.8+ MB

#### Convert to right datatypes

In [8]:
df_car_sales['car_id_sales'] = df_car_sales['car_id_sales'].astype('str')
df_car_sales['merchant_id'] = df_car_sales['merchant_id'].astype('str')

df_car_sales['selling_date'] = pd.to_datetime(df_car_sales['selling_date'])
df_car_sales['payment_date'] = pd.to_datetime(df_car_sales['payment_date'])
df_car_sales['transport_date'] = pd.to_datetime(df_car_sales['transport_date'])

df_car_sales.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 70512 entries, 0 to 70511
Data columns (total 9 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   car_id_sales           70512 non-null  object
 1   country                70512 non-null  object
 2   merchant_id            70512 non-null  object
 3   selling_date           70512 non-null  datetime64[ns]
 4   selling_week           70512 non-null  object
 5   payment_date           70512 non-null  datetime64[ns]
 6   sell_price             70512 non-null  int64
 7   transport_to_merchant  70512 non-null  int64
 8   transport_date         33082 non-null  datetime64[ns]
dtypes: datetime64[ns](3), int64(2), object(4)
memory usage: 4.8+ MB

## Car_Details Dataframe Cleaning

In [9]:
df_car_details.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 70512 entries, 0 to 70511
Data columns (total 10 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   car_id_details     70512 non-null  int64
 1   has_tuning         70512 non-null  int64
 2   has_airbags        70512 non-null  int64
 3   has_alarm_system   70512 non-null  int64
 4   fuel_type          70512 non-null  int64
 5   gear_type          70512 non-null  int64
 6   ac_type            70512 non-null  int64
 7   xenon_light        70512 non-null  int64
 8   navigation_system  70512 non-null  int64
 9   radio_system       43883 non-null  float64
dtypes: float64(1), int64(9)
memory usage: 5.4 MB

#### Convert to right datatypes

In [11]:
df_car_details['car_id_details'] = df_car_details['car_id_details'].astype('str')

df_car_details.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 70512 entries, 0 to 70511
Data columns (total 10 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   car_id_details     70512 non-null  object
 1   has_tuning         70512 non-null  int64
 2   has_airbags        70512 non-null  int64
 3   has_alarm_system   70512 non-null  int64
 4   fuel_type          70512 non-null  int64
 5   gear_type          70512 non-null  int64
 6   ac_type            70512 non-null  int64
 7   xenon_light        70512 non-null  int64
 8   navigation_system  70512 non-null  int64
 9   radio_system       43883 non-null  float64
dtypes: float64(1), int64(8), object(1)
memory usage: 5.4+ MB

## Car_Claims Dataframe Cleaning

In [12]:
df_car_claims.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 70512 entries, 0 to 70511
Data columns (total 6 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   car_id_claims    70512 non-null  int64
 1   claim_number     19982 non-null  object
 2   full_refunds     70512 non-null  int64
 3   partial_refunds  70512 non-null  int64
 4   voucher_amount   15173 non-null  float64
 5   claim_status     19982 non-null  object
dtypes: float64(1), int64(3), object(2)
memory usage: 3.2+ MB